app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "asd"], ["created_at", "2015-09-12 17:35:12.671718"], ["updated_at", "2015-09-12 17:35:12.671718"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE `books` SET `name` = ?, `updated_at` = ? WHERE `books`.`id` = ?  [["name", "Sherlock Holmes1"], ["updated_at", "2015-09-12 11:38:42"], ["id", 1]]